// 8.Вывести на экран четные числа от -N до N
// Вариант мой
/*int N=Convert.ToInt32(Console.ReadLine());
int i=-N;

    while ( i<=N)
{
    System.Console.Write($"{i} ");
    i=i+2;
}
*/


//Вариант Андрея
int N=Convert.ToInt32(Console.ReadLine())
for (int i=-N;i<=N;i++)
System.Console.Write($"{i} ");